## Using SQL

In [1]:
#import necessary packages 
import sqlite3
import pandas as pd

In [2]:
# connect database and create cursor
conn = sqlite3.connect('nba_salary.sqlite')
cur = conn.cursor()

In [3]:
# executing the query to select all rows from first 5 entries in first table 
cur.execute("""SELECT * FROM NBA_season1718_salary LIMIT 5;""")

In [4]:
#Create the answer variable 
ans = cur.fetchall()

In [5]:
#Print the result of the query
print(ans)

[(1.0, 'Stephen Curry', 'GSW', 34682550.0), (2.0, 'LeBron James', 'CLE', 33285709.0), (3.0, 'Paul Millsap', 'DEN', 31269231.0), (4.0, 'Gordon Hayward', 'BOS', 29727900.0), (5.0, 'Blake Griffin', 'DET', 29512900.0)]

In [6]:
# executing the query to select all rows from first 5 entries in second table 
cur.execute("""SELECT * FROM Seasons_Stats LIMIT 5;""")

In [7]:
#Create the answer variable for the above query  
ans2 = cur.fetchall()

In [8]:
#Print the result of the query
print(ans2)

[(0.0, 1950.0, 'Curly Armstrong', 'G-F', 31.0, 'FTW', 63.0, None, None, None, 0.368, None, 0.467, None, None, None, None, None, None, None, None, None, -0.1, 3.6, 3.5, None, None, None, None, None, None, 144.0, 516.0, 0.279, None, None, None, 144.0, 516.0, 0.279, 0.279, 170.0, 241.0, 0.705, None, None, None, 176.0, None, None, None, 217.0, 458.0), (1.0, 1950.0, 'Cliff Barker', 'SG', 29.0, 'INO', 49.0, None, None, None, 0.435, None, 0.387, None, None, None, None, None, None, None, None, None, 1.6, 0.6, 2.2, None, None, None, None, None, None, 102.0, 274.0, 0.372, None, None, None, 102.0, 274.0, 0.372, 0.372, 75.0, 106.0, 0.708, None, None, None, 109.0, None, None, None, 99.0, 279.0), (2.0, 1950.0, 'Leo Barnhorst', 'SF', 25.0, 'CHS', 67.0, None, None, None, 0.394, None, 0.259, None, None, None, None, None, None, None, None, None, 0.9, 2.8, 3.6, None, None, None, None, None, None, 174.0, 499.0, 0.349, None, None, None, 174.0, 499.0, 0.349, 0.349, 90.0, 129.0, 0.698, None, None, None, 140.0, None, None, None, 192.0, 438.0), (3.0, 1950.0, 'Ed Bartels', 'F', 24.0, 'TOT', 15.0, None, None, None, 0.312, None, 0.395, None, None, None, None, None, None, None, None, None, -0.5, -0.1, -0.6, None, None, None, None, None, None, 22.0, 86.0, 0.256, None, None, None, 22.0, 86.0, 0.256, 0.256, 19.0, 34.0, 0.559, None, None, None, 20.0, None, None, None, 29.0, 63.0), (4.0, 1950.0, 'Ed Bartels', 'F', 24.0, 'DNN', 13.0, None, None, None, 0.308, None, 0.378, None, None, None, None, None, None, None, None, None, -0.5, -0.1, -0.6, None, None, None, None, None, None, 21.0, 82.0, 0.256, None, None, None, 21.0, 82.0, 0.256, 0.256, 17.0, 31.0, 0.548, None, None, None, 20.0, None, None, None, 27.0, 59.0)]

In [9]:
#execute the SQL query 
cur.execute("""SELECT X1, Year, Player, Pos, Age, Tm, G FROM Seasons_Stats;""")

In [10]:
#convert to Dataframe
df = pd.DataFrame(cur.fetchall())
df.head()

     0       1                2    3     4    5     6
0  0.0  1950.0  Curly Armstrong  G-F  31.0  FTW  63.0
1  1.0  1950.0     Cliff Barker   SG  29.0  INO  49.0
2  2.0  1950.0    Leo Barnhorst   SF  25.0  CHS  67.0
3  3.0  1950.0       Ed Bartels    F  24.0  TOT  15.0
4  4.0  1950.0       Ed Bartels    F  24.0  DNN  13.0

In [11]:
#Rename the dataframe columns 
df.columns = ['ID', 'Year', 'Player', 'Position', 'Age', 'Team', 'Game']

In [12]:
#Investigate first 5 rows of dataframe
df.head()

    ID    Year           Player Position   Age Team  Game
0  0.0  1950.0  Curly Armstrong      G-F  31.0  FTW  63.0
1  1.0  1950.0     Cliff Barker       SG  29.0  INO  49.0
2  2.0  1950.0    Leo Barnhorst       SF  25.0  CHS  67.0
3  3.0  1950.0       Ed Bartels        F  24.0  TOT  15.0
4  4.0  1950.0       Ed Bartels        F  24.0  DNN  13.0

In [13]:
#Look at information of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24691 entries, 0 to 24690
Data columns (total 7 columns):
ID          24691 non-null float64
Year        24624 non-null float64
Player      24624 non-null object
Position    24624 non-null object
Age         24616 non-null float64
Team        24624 non-null object
Game        24624 non-null float64
dtypes: float64(4), object(3)
memory usage: 1.3+ MB

In [14]:
#Print the summary statistics
df.describe()

                 ID          Year           Age          Game
count  24691.000000  24624.000000  24616.000000  24624.000000
mean   12345.000000   1992.594989     26.664405     50.837110
std     7127.822084     17.429594      3.841892     26.496161
min        0.000000   1950.000000     18.000000      1.000000
25%     6172.500000   1981.000000     24.000000     27.000000
50%    12345.000000   1996.000000     26.000000     58.000000
75%    18517.500000   2007.000000     29.000000     75.000000
max    24690.000000   2017.000000     44.000000     88.000000

In [15]:
#Execute query to select data from second table in Dataset 
cur.execute("""SELECT * FROM NBA_season1718_salary;""")

In [16]:
#Create dataframe with this extra query
df2 = pd.DataFrame(cur.fetchall())
df2.head()

     0               1    2           3
0  1.0   Stephen Curry  GSW  34682550.0
1  2.0    LeBron James  CLE  33285709.0
2  3.0    Paul Millsap  DEN  31269231.0
3  4.0  Gordon Hayward  BOS  29727900.0
4  5.0   Blake Griffin  DET  29512900.0

In [17]:
#Rename the dataframe columns 
df2.columns = ['ID', 'Player', 'Team', 'Salary']

In [18]:
#View the dataframe again 
df2.head()

    ID          Player Team      Salary
0  1.0   Stephen Curry  GSW  34682550.0
1  2.0    LeBron James  CLE  33285709.0
2  3.0    Paul Millsap  DEN  31269231.0
3  4.0  Gordon Hayward  BOS  29727900.0
4  5.0   Blake Griffin  DET  29512900.0

In [19]:
#Look at information on dataframe 
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 573 entries, 0 to 572
Data columns (total 4 columns):
ID        573 non-null float64
Player    573 non-null object
Team      573 non-null object
Salary    573 non-null float64
dtypes: float64(2), object(2)
memory usage: 18.0+ KB

In [20]:
#Describe the dataframe
df.describe()

                 ID          Year           Age          Game
count  24691.000000  24624.000000  24616.000000  24624.000000
mean   12345.000000   1992.594989     26.664405     50.837110
std     7127.822084     17.429594      3.841892     26.496161
min        0.000000   1950.000000     18.000000      1.000000
25%     6172.500000   1981.000000     24.000000     27.000000
50%    12345.000000   1996.000000     26.000000     58.000000
75%    18517.500000   2007.000000     29.000000     75.000000
max    24690.000000   2017.000000     44.000000     88.000000

In [21]:
#Join the Dataframes
joined_df = pd.concat([df, df2], axis=1, join='outer')

In [22]:
#View the joined dataframe
joined_df.head()

,ID,Year,Player,Position,Age,Team,Game,ID,Player,Team,Salary
0,0.0,1950.0,Curly Armstrong,G-F,31.0,FTW,63.0,1.0,Stephen Curry,GSW,34682550.0
1,1.0,1950.0,Cliff Barker,SG,29.0,INO,49.0,2.0,LeBron James,CLE,33285709.0
2,2.0,1950.0,Leo Barnhorst,SF,25.0,CHS,67.0,3.0,Paul Millsap,DEN,31269231.0
3,3.0,1950.0,Ed Bartels,F,24.0,TOT,15.0,4.0,Gordon Hayward,BOS,29727900.0
4,4.0,1950.0,Ed Bartels,F,24.0,DNN,13.0,5.0,Blake Griffin,DET,29512900.0

In [23]:
#Look at info of new df
joined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24691 entries, 0 to 24690
Data columns (total 11 columns):
ID          24691 non-null float64
Year        24624 non-null float64
Player      24624 non-null object
Position    24624 non-null object
Age         24616 non-null float64
Team        24624 non-null object
Game        24624 non-null float64
ID          573 non-null float64
Player      573 non-null object
Team        573 non-null object
Salary      573 non-null float64
dtypes: float64(6), object(5)
memory usage: 2.1+ MB

In [24]:
#Look at shape of joined dataframe
joined_df.shape

(24691, 11)

In [25]:
#Look at summary statistics of joined dataframe
joined_df.describe()

,ID,Year,Age,Game,ID,Salary
count,24691.000000,24624.000000,24616.000000,24624.000000,573.000000,5.730000e+02
mean,12345.000000,1992.594989,26.664405,50.837110,287.000000,5.858946e+06
std,7127.822084,17.429594,3.841892,26.496161,165.555127,7.162373e+06
min,0.000000,1950.000000,18.000000,1.000000,1.000000,1.722400e+04
25%,6172.500000,1981.000000,24.000000,27.000000,144.000000,1.312611e+06
50%,12345.000000,1996.000000,26.000000,58.000000,287.000000,2.386864e+06
75%,18517.500000,2007.000000,29.000000,75.000000,430.000000,7.936509e+06
max,24690.000000,2017.000000,44.000000,88.000000,573.000000,3.468255e+07

In [26]:
#Count NA values 
joined_df.isna().sum()

ID              0
Year           67
Player         67
Position       67
Age            75
Team           67
Game           67
ID          24118
Player      24118
Team        24118
Salary      24118
dtype: int64

In [30]:
#Fill 'Year', 'Player', 'Team' and 'Posiiton', 'ID', NA values with 0
joined_df['Year'] = joined_df['Year'].fillna(0)
joined_df['Player'] = joined_df['Player'].fillna(0)
joined_df['Team'] = joined_df['Team'].fillna(0)
joined_df['Position'] = joined_df['Position'].fillna(0)
joined_df['ID'] = joined_df['ID'].fillna(0)

In [31]:
#Fill 'Age' NA values with the mean age 
joined_df['Age'] = joined_df['Age'].fillna(joined_df['Age'].mean())

In [32]:
#Check NAs again
joined_df.isna().sum()

ID              0
Year            0
Player          0
Position        0
Age             0
Team            0
Game           67
ID              0
Player          0
Team            0
Salary      24118
dtype: int64